#include "HEAD.h"
using namespace std;

void Print()
{

}


void Browse()
{//功能：按学号、姓名、成绩排序
	Print();

}
void Add()
{//功能：1.检查是否已存在，若存在则提示后返回重新添加，否则继续；2.添加成功后打印所有数据；3.添加之后询问是否继续添加；4.在每次添加时可以选择退出添加函数；
	cout << "请输入要添加的学号："<< endl;

	

}
void Delete()
{//功能：（最开始先检查系统中是否有数据）1.检查是否存在，若不存在则提示后返回重新输入，否则继续；2.若存在则打印该数据，并询问确认删除，No（返回继续输入）；
//3.成功删除后打印所有数据，并询问是否继续删除;4.每次输入删除数据时可以选择返回上层菜单；


}
void Modify()
{//功能：1.检查系统中是否有数据；2.输入数据后检查是否存在；3.若存在则打印该数据，并询问确认修改，No（返回继续输入）；
//4.成功修改后打印所有数据，并询问是否继续删除;4.每次输入修改数据时可以选择返回上层菜单；

}
void Find()
{//功能：按学号范围查找、按成绩范围、按姓名查找

}
void Welcome()
{
	puts("\n\n");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t********                                *********");
	puts("\t\t********    欢迎来到学生信息管理系统    *********");
	puts("\t\t********                                *********");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t************************************  byLeonLH  *");
	puts("\t\t*************************************************");
	system("pause");

}

int Menu()
{
	system("cls");
	puts("\n\n");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t*******                                *******");
	puts("\t\t*******         1.浏览学生信息         *******");
	puts("\t\t*******         2.添加学生信息         *******");
	puts("\t\t*******         3.删除学生信息         *******");
	puts("\t\t*******         4.修改学生信息         *******");
	puts("\t\t*******         5.查找学生信息         *******");
	puts("\t\t*******         0.退出                 *******");
	puts("\t\t*******                                *******");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	int i;
	scanf_s("%d",&i);
	switch(i)
		{
			case 1:
				Browse();
				break;
			case 2:
				Add();
				break;
			case 3:
				Delete();
				break;
			case 4:
				Modify();
				break;
			case 5:
				Find();
				break;
			case 0:
				break;
	}
	return i;

}