#include"Stud.h"

SNode *g_pHead = 0; 

int Menu()
{
	system("cls");
	puts("\n\n");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t*******                                *******");
	puts("\t\t*******         1.浏览学生信息         *******");
	puts("\t\t*******         2.添加学生信息         *******");
	puts("\t\t*******         3.删除学生信息         *******");
	puts("\t\t*******         4.修改学生信息         *******");
	puts("\t\t*******         5.查找学生信息         *******");
	puts("\t\t*******         0.退出                 *******");
	puts("\t\t*******                                *******");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	int i;
	scanf_s("%d",&i);
	switch(i)
		{
			case 1:
				Browse();
				break;
			case 2:
				Add();
				break;
			case 3:
				Delete();
				break;
			case 4:
//				Modify();
				break;
			case 5:
//				Search();
				break;
			case 0:
				break;
	}
	return i;

}
void Welcome()
{
	puts("\n\n");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t********                                *********");
	puts("\t\t********    欢迎来到学生信息管理系统    *********");
	puts("\t\t********                                *********");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t************************************  byLeonLH  *");
	puts("\t\t*************************************************");
	system("pause");

}


//1、本项目已调试完毕，功能尚未开发完毕，待加入功能还有修改、查找等模块
//2、本项目的缺点：此项目架构存在较大的缺陷，功能和功能所实现的函数混在一个函数中，即带来了开发时思维难度，又增加了开发的时间
//和精力。For example，在Load函数和Add函数中都会用到，往数据中添加的功能，而没有为此功能开发独立的函数，没有增
//加函数的复用性。诸如此类还有数据删除功能，修改查找功能等
void main()
{

	system("color 1f");
	Welcome();
	Load();
	while(Menu())
		;
	Save();

}
