#include "Main.h"
#include"Student.h"
#include"Manager.h"


extern TDATA g_curUser;

Main::Main(void)
{
}


Main::~Main(void)
{
}
void Main::Welcome()
{
	puts("\n\n");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t********                                *********");
	puts("\t\t********    欢迎来到学生信息管理系统    *********");
	puts("\t\t********                                *********");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t*************************************************");
	puts("\t\t************************************  byLeonLH  *");
	puts("\t\t*************************************************");
	system("pause");

}


int Main::Menu()
{
	system("cls");
	puts("\n\n");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t*******                                *******");
	puts("\t\t*******         1.浏览学生信息         *******");
	puts("\t\t*******         2.添加学生信息         *******");
	puts("\t\t*******         3.删除学生信息         *******");
	puts("\t\t*******         4.修改学生信息         *******");
	puts("\t\t*******         5.查找学生信息         *******");
	puts("\t\t*******         6.修改用户密码         *******");
	if(!g_curUser.nPrio)
		puts("\t\t*******         7.账户管理             *******");
	puts("\t\t*******         0.退出                 *******");
	puts("\t\t*******                                *******");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	puts("\t\t**********************************************");
	int i;
	scanf_s("%d",&i);
	switch(i)
		{
			case 1:
//				m_stu.Print();
//				system("pause");
				while(m_stu.Browse())
					;
				break;
			case 2:
				m_stu.Input();
				break;
			case 3:
				m_stu.Delete();
				break;
			case 4:
				m_stu.Modify();
				break;
			case 5:
				while(m_stu.Find())
					;
				break;
			case 6:
				while(!m_man.ChangePassWord())
					;
				break;
			case 7:
				while(m_man.Menu())
					;
				break;
			case 0:
				break;
	}
	
	return i;

}

void Main::Exit()
{

}
void Main::Run()
{
	
	while(!m_man.Login())
		;
	while(Menu())
		;
/**/
}
